# ----------------------------------------
# CLI Utilities
# ----------------------------------------
brew "git"
brew "ffmpeg"

# ----------------------------------------
# Browsers & Communication
# ----------------------------------------
cask "brave-browser"
cask "google-chrome"
cask "firefox"
cask "thunderbird"
cask "whatsapp"

# ----------------------------------------
# Office & Productivity
# ----------------------------------------
cask "microsoft-office"
cask "alfred"
cask "nextcloud"
cask "logi-options+"
cask "1password"
cask "cleanshot"

# ----------------------------------------
# Development Tools
# ----------------------------------------
cask "iterm2"
cask "docker"
cask "postman"
cask "phpstorm"
cask "visual-studio-code"
cask "sublime-text"
cask "github"
cask "sequel-ace"

# ----------------------------------------
# Design & Photography
# ----------------------------------------
cask "adobe-creative-cloud"
cask "imageoptim"
cask "sketch"

# ----------------------------------------
# Virtualization & Compatibility
# ----------------------------------------
cask "parallels"
cask "xquartz"
cask "windows-app"

# ----------------------------------------
# Security
# ----------------------------------------
cask "yubico-yubikey-manager"
cask "surfshark"

# ----------------------------------------
# Gaming
# ----------------------------------------
cask "steam"
cask "sony-ps-remote-play"
cask "nvidia-geforce-now"

# ----------------------------------------
# Fonts
# ----------------------------------------
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
